In [1]:
def f():
    print("간단한 함수 호출")
    
f()

간단한 함수 호출

In [2]:
def my_func(s):
    text = "전달된 값은 '{}'이고, 길이는 {}입니다.".format(s, len(s))
    return text

my_func("인생은 나그네길")

"전달된 값은 '인생은 나그네길'이고, 길이는 8입니다."

In [3]:
def my_sum(a, b):
    s = a + b  
    return s  
s = my_sum(10, 20)
print(s)

30

In [4]:
def get_sign(x):
    if x > 0:
        return "양수"
    elif x < 0:  
        return "음수"
    else:
        return "영"

for x in [-1, 0, 1]:
    print(get_sign(x))

음수
영
양수

In [5]:
def stat_func(a, b):
    total = a + b
    avg = total / 2
    return total, avg 

stat_func(10, 20)

(30, 15.0)

In [6]:
s, a = stat_func(10, 20)
print(s)
print(a)

30
15.0

In [7]:
def f(x, y, z=0):
    print(x, y, z)

f(10, 20, z=50)

10 20 50

In [8]:
f(10, 20)

10 20 0

In [14]:
lst= [3,4,2,5 ]
sorted(lst)

[2, 3, 4, 5]

In [15]:
sorted(lst, reverse=True)

[5, 4, 3, 2]

In [16]:
import math
r=3
area = math.pi * math.pow(r,2)
area

28.274333882308138

In [17]:
dir(math)

['__doc__',
 '__loader__',
 '__name__',
 '__package__',
 '__spec__',
 'acos',
 'acosh',
 'asin',
 'asinh',
 'atan',
 'atan2',
 'atanh',
 'ceil',
 'comb',
 'copysign',
 'cos',
 'cosh',
 'degrees',
 'dist',
 'e',
 'erf',
 'erfc',
 'exp',
 'expm1',
 'fabs',
 'factorial',
 'floor',
 'fmod',
 'frexp',
 'fsum',
 'gamma',
 'gcd',
 'hypot',
 'inf',
 'isclose',
 'isfinite',
 'isinf',
 'isnan',
 'isqrt',
 'ldexp',
 'lgamma',
 'log',
 'log10',
 'log1p',
 'log2',
 'modf',
 'nan',
 'perm',
 'pi',
 'pow',
 'prod',
 'radians',
 'remainder',
 'sin',
 'sinh',
 'sqrt',
 'tan',
 'tanh',
 'tau',
 'trunc']

In [18]:
help(math.pow)

Help on built-in function pow in module math:

pow(x, y, /)
    Return x**y (x to the power of y).

In [21]:
import pandas
len(dir(pandas))

142

In [22]:
import sys
sys.version

'3.8.8 (default, Apr 13 2021, 15:08:03) [MSC v.1916 64 bit (AMD64)]'

In [25]:
s = 'D-A-D is a Danish rock band. It was originally named "Disneyland After Dark", but changed their name to avoid a lawsuit from The Walt Disney Company'
len(s.split())

26

In [37]:
text = '''
(서울=연합뉴스) 문다영 기자 = 한국형 발사체(KSLV-Ⅱ) 누리호 발사일인 15일이 열흘 남짓 앞으로 다가왔다.

4일 과학기술정보통신부(과기정통부)와 한국항공우주연구원(항우연)에 따르면 누리호는 예정된 일정에 따라 전남 고흥군 나로우주센터 발사체 종합조립동에서 순조롭게 조립되고 있다.

점검을 마친 성능검증위성이 누리호 3단에 탑재됐으며, 오는 12일께는 3단과 1·2단의 결합이 이뤄질 것으로 예상된다.

나로우주센터에서 조립을 마친 누리호가 어떻게 발사대로 옮겨져 우주 공간까지 날아가는지, 누리호의 발사 당일 전후 일정을 정리해봤다.

전날 발사대로 이동해 기립…15일 오후 발사 예정
항우연에 따르면 누리호는 발사 전날(14일) 조립동에서 무인특수이동차량(트랜스포터)에 실려 제2발사대로 이동한다.

발사패드까지 수평으로 눕혀서 이동한 누리호는 이렉터(erector)를 이용해 발사패드에 고정돼, 수직으로 기립한다.

제2발사대는 현대중공업이 총괄해 순수 국내 기술로 구축했다. 제1발사대인 나로호 발사대와 달리 지상에 높이 45ｍ의 엄빌리칼(umbilical) 타워를 설치해 발사체에 추진제와 가스류 등 연료를 공급한다.

하늘을 향해 꼿꼿이 선 누리호에 페어링 공조 엄빌리칼, 전기 공급 엄빌리칼 등을 연결하고 연료나 산화제 충전 과정에서 막히거나 새는 곳은 없는지 기밀시험을 한다.

발사 당일인 15일에는 연료와 전기 계통을 중심으로 모든 부분을 종합적으로 점검한다.

발사 4시간 전부터는 연료와 산화제 주입을 위한 절차를 시작하며, 충전을 마치면 기립 장치를 제거한다.

발사 예정 시간까지 모든 기기가 정상상태를 유지하고 주변 환경이 이상이 없다면 10분 전부터는 발사자동운용(PLO) 프로그램을 가동한다.

PLO 프로그램을 통해 자동으로 준비 작업이 이뤄지며, 1단 엔진 추력이 300t에 도달하면 지상고정장치(VHD) 해제 명령이 내려진다.

이때 누리호는 나로우주센터(동경 127.53도, 북위 34.43도)에서 이륙한다. 정확한 발사 시각은 당일에 결정되지만, 지난 1차 발사 때와 비슷하게 오후 3시∼7시에 이뤄질 예정이다.

발사 14분 57초만에 목표 궤도 올라…42분 23초 뒤 첫 위성 신호 수신
누리호는 이륙 이후 2분 7초(127초) 이후 고도 59㎞에서 1단이 분리된다. 3분 53초(233초) 후에는 공기 마찰이 거의 없는 고도 191㎞에서 페어링(위성 등 발사체 탑재물을 보호하는 역할을 하는 덮개)이 분리된다.

발사 후 4분 34초(274초)가 지나면 고도 258㎞에서 2단이 분리되고 3단 엔진이 가동된다.

1단과 페어링, 2단이 분리된 뒤 낙하하는 곳은 각각 발사장에서 약 413㎞, 1천514㎞, 2천800㎞ 떨어진 해상일 것으로 예상된다.

발사 후 14분 57초(897초)에 초속 7.5㎞의 궤도속도에 이르고 고도 700㎞에 오르면 약 180㎏의 성능검증위성이 분리된다.

발사 후 16분 7초(967초)에는 같은 고도인 700㎞에서 1.3t 위성모사체를 분리한다. 위성모사체는 누리호의 사업 목표인 '1.5t 위성 탑재'를 달성하기 위해 실린다.

성능검증위성과 위성모사체가 제대로 분리돼 목표 궤도에 올라가 있는지를 확인하는 데는 데이터 분석이 필요하며, 약 30분 뒤에 성공 여부를 확실히 확인할 수 있다.

누리호의 추적을 위해 나로우주센터와 제주도에서 추적 레이더와 텔레메트리 안테나를 운용한다. 3단 엔진 종료와 위성 분리 등 후반부 비행에 관한 데이터는 서태평양에 있는 팔라우 추적소를 통해 받는다.

성능검증위성의 첫 교신은 발사 후 42분 23초에 남극 세종기지에서 이뤄질 예정이다. 발사 1시간 40분 6초가 지나면 대전 항우연 지상국에서 다시 한번 교신을 시도한다.

발사 약 4시간 뒤에는 세종기지에서 비콘 신호를 확인해 성능검증 위성의 자세가 안정화됐는지를 확인한다.

발사 다음 날부터는 대전 지상국에서 지속해서 교신하며 위성의 상태를 더욱 자세하게 파악할 수 있을 것으로 보인다.
'''

In [38]:
word_list = text.split()

In [39]:
word_list[:10]

['(서울=연합뉴스)',
 '문다영',
 '기자',
 '=',
 '한국형',
 '발사체(KSLV-Ⅱ)',
 '누리호',
 '발사일인',
 '15일이',
 '열흘']

In [40]:
len(word_list)

415

In [44]:
from collections import Counter

cntr = Counter(word_list)
print(cntr.most_common(10))

[('발사', 16), ('누리호는', 5), ('고도', 4), ('후', 4), ('약', 4), ('이뤄질', 3), ('것으로', 3), ('누리호의', 3), ('등', 3), ('위성', 3)]

In [59]:
from datetime import datetime, timedelta

dt = datetime(1972,10,7)
dt
cur_date = datetime.now()

In [48]:
cur_date

datetime.datetime(2022, 6, 4, 11, 17, 4, 666983)

In [50]:
my_dt = cur_date - dt

In [52]:
my_dt.days

18137

In [54]:
now = datetime.today()
now

datetime.datetime(2022, 6, 4, 11, 19, 27, 555230)

In [57]:
datetime.today()

datetime.datetime(2022, 6, 4, 11, 20, 27, 216088)

In [63]:
now = datetime.today() + timedelta(hours=9)
now

datetime.datetime(2022, 6, 4, 20, 23, 10, 101228)

In [65]:
d = datetime(1972,10,7)

In [69]:
print(f"나의 생일은 {d}. 요일은 {'월화수목금토일'[d.weekday()]}요일 입니다.")

나의 생일은 1972-10-07 00:00:00. 요일은 토요일 입니다.

In [71]:
import keyword
print(len(keyword.kwlist))
print(keyword.kwlist)

35
['False', 'None', 'True', 'and', 'as', 'assert', 'async', 'await', 'break', 'class', 'continue', 'def', 'del', 'elif', 'else', 'except', 'finally', 'for', 'from', 'global', 'if', 'import', 'in', 'is', 'lambda', 'nonlocal', 'not', 'or', 'pass', 'raise', 'return', 'try', 'while', 'with', 'yield']

In [72]:
data = {
'A' : [10, 20, 30],
'B' : [40, 50, 60],
'C' : [70, 80, 90],
}
data

{'A': [10, 20, 30], 'B': [40, 50, 60], 'C': [70, 80, 90]}

In [76]:
import pandas as pd

df = pd.DataFrame(data, index=[1,2,3])
df

    A   B   C
1  10  40  70
2  20  50  80
3  30  60  90

In [77]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [78]:
df.index

Int64Index([1, 2, 3], dtype='int64')

In [79]:
df.values

array([[10, 40, 70],
       [20, 50, 80],
       [30, 60, 90]], dtype=int64)

In [83]:
df.A

1    10
2    20
3    30
Name: A, dtype: int64

In [81]:
df.C

1    70
2    80
3    90
Name: C, dtype: int64

In [82]:
df.B

1    40
2    50
3    60
Name: B, dtype: int64

In [84]:
df[['A','B']]

    A   B
1  10  40
2  20  50
3  30  60

In [85]:
df.B

1    40
2    50
3    60
Name: B, dtype: int64

In [86]:
df.B.values

array([40, 50, 60], dtype=int64)

In [87]:
df.B

1    40
2    50
3    60
Name: B, dtype: int64

In [88]:
df.B.values

array([40, 50, 60], dtype=int64)

In [89]:
df

    A   B   C
1  10  40  70
2  20  50  80
3  30  60  90

In [90]:
df[1:2]

    A   B   C
2  20  50  80

In [91]:
df.iloc[1]

A    20
B    50
C    80
Name: 2, dtype: int64

In [92]:
df.iloc['A']

TypeError: Cannot index by location index with a non-integer key

In [93]:
df.iloc[1,1]

50

In [94]:
df['텔레콤_합계'] = 0

In [95]:
df

    A   B   C  텔레콤_합계
1  10  40  70       0
2  20  50  80       0
3  30  60  90       0

In [96]:
df['텔레콤_합계'] = 1+1

In [97]:
df

    A   B   C  텔레콤_합계
1  10  40  70       2
2  20  50  80       2
3  30  60  90       2

In [98]:
df = df/100

In [99]:
df

     A    B    C  텔레콤_합계
1  0.1  0.4  0.7    0.02
2  0.2  0.5  0.8    0.02
3  0.3  0.6  0.9    0.02

In [100]:
df = df*100

In [101]:
df

      A     B     C  텔레콤_합계
1  10.0  40.0  70.0     2.0
2  20.0  50.0  80.0     2.0
3  30.0  60.0  90.0     2.0

In [102]:
df.dtypes

A         float64
B         float64
C         float64
텔레콤_합계    float64
dtype: object

In [103]:
df = df.astype(int)

In [104]:
df

    A   B   C  텔레콤_합계
1  10  40  70       2
2  20  50  80       2
3  30  60  90       2

In [105]:
values = {
'삼성전자': [17213058, 15767139, 14289812, 4972074, 23522875, 25040023],
'LG전자': [17695770, 18344561, 14807176, 11391979, 4874541, 17347968],
'현대자동차': [ 7691742, 9932071, 12660962, 9596229, 4993788, 6374132],
'SK텔레콤' : [5811352, 5760428, 6626276, 5834792, 2757485, 3168658],
'KT': [4966225, 2329041, 8914585, 3650543, 5236393, 6835417],
}

dates = pd.to_datetime(['2019-10', '2019-11', '2019-12', '2020-01', '2020-02', '2020-03'])

df = pd.DataFrame(values, index=dates)
df

                삼성전자      LG전자     현대자동차    SK텔레콤       KT
2019-10-01  17213058  17695770   7691742  5811352  4966225
2019-11-01  15767139  18344561   9932071  5760428  2329041
2019-12-01  14289812  14807176  12660962  6626276  8914585
2020-01-01   4972074  11391979   9596229  5834792  3650543
2020-02-01  23522875   4874541   4993788  2757485  5236393
2020-03-01  25040023  17347968   6374132  3168658  6835417

In [106]:
df.index

DatetimeIndex(['2019-10-01', '2019-11-01', '2019-12-01', '2020-01-01',
               '2020-02-01', '2020-03-01'],
              dtype='datetime64[ns]', freq=None)

In [108]:
df.삼성전자<150

2019-10-01    False
2019-11-01    False
2019-12-01    False
2020-01-01    False
2020-02-01    False
2020-03-01    False
Name: 삼성전자, dtype: bool

In [109]:
df1 = df/100000
df1

                 삼성전자       LG전자      현대자동차     SK텔레콤        KT
2019-10-01  172.13058  176.95770   76.91742  58.11352  49.66225
2019-11-01  157.67139  183.44561   99.32071  57.60428  23.29041
2019-12-01  142.89812  148.07176  126.60962  66.26276  89.14585
2020-01-01   49.72074  113.91979   95.96229  58.34792  36.50543
2020-02-01  235.22875   48.74541   49.93788  27.57485  52.36393
2020-03-01  250.40023  173.47968   63.74132  31.68658  68.35417

In [110]:
df1.삼성전자<150

2019-10-01    False
2019-11-01    False
2019-12-01     True
2020-01-01     True
2020-02-01    False
2020-03-01    False
Name: 삼성전자, dtype: bool

In [111]:
df1[df1.삼성전자<150]

                 삼성전자       LG전자      현대자동차     SK텔레콤        KT
2019-12-01  142.89812  148.07176  126.60962  66.26276  89.14585
2020-01-01   49.72074  113.91979   95.96229  58.34792  36.50543